<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
<key>PayloadContent</key>
<array>
<dict>
<key>DNSSettings</key>
<dict>
<key>DNSProtocol</key>
<string>HTTPS</string>
<key>ServerAddresses</key>
<array>
<string>2606:4700:4700::1113</string>
<string>2606:4700:4700::1003</string>
<string>1.1.1.3</string>
<string>1.0.0.3</string>
</array>
<key>ServerURL</key>
<string>https://cloudflare-dns.com/dns-query</string>
</dict>
<key>PayloadDisplayName</key>
<string>Cloudflare (No Malware or Adult Content) - DNS over HTTPS</string>
<key>PayloadDescription</key>
<string>This profile configures your device to use Cloudflare (No Malware or Adult Content) DNS over HTTPS.

It is compatible with devices running iOS 14 and macOS 11.0 or later.</string>
<key>PayloadType</key>
<string>com.apple.dnsSettings.managed</string>
<key>PayloadIdentifier</key>
<string>com.apple.dnsSettings.managed.3D2A9210-5694-4504-8815-8D98B3520202</string>
<key>PayloadUUID</key>
<string>BF651EBA-DBDA-470E-B911-F408E0CE38F4</string>
<key>PayloadVersion</key>
<integer>1</integer>
<key>ProhibitDisablement</key>
<false/>
</dict>
</array>
<key>PayloadDisplayName</key>
<string>Cloudflare (No Malware or Adult Content) - DNS over HTTPS</string>
<key>PayloadDescription</key>
<string>This profile configures your device to use Cloudflare (No Malware or Adult Content) DNS over HTTPS.

It is compatible with devices running iOS 14 and macOS 11.0 or later.</string>
<key>PayloadType</key>
<string>Configuration</string>
<key>PayloadIdentifier</key>
<string>com.joseph-rees.encrypted-dns</string>
<key>PayloadUUID</key>
<string>B42A5E24-71E2-48F7-9604-6F72A3B35AB8</string>
<key>PayloadVersion</key>
<integer>1</integer>
<key>PayloadRemovalDisallowed</key>
<false/>
</dict>
</plist>