<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
<key>PayloadContent</key>
<array>
<dict>
<key>DNSSettings</key>
<dict>
<key>DNSProtocol</key>
<string>HTTPS</string>
<key>ServerAddresses</key>
<array>
<string>2606:4700:4700::1112</string>
<string>2606:4700:4700::1002</string>
<string>1.1.1.2</string>
<string>1.0.0.2</string>
</array>
<key>ServerURL</key>
<string>https://cloudflare-dns.com/dns-query</string>
</dict>
<key>PayloadDisplayName</key>
<string>Cloudflare (No Malware) - DNS over HTTPS</string>
<key>PayloadDescription</key>
<string>This profile configures your device to use Cloudflare (No Malware) DNS over HTTPS.

It is compatible with devices running iOS 14 and macOS 11.0 or later.</string>
<key>PayloadType</key>
<string>com.apple.dnsSettings.managed</string>
<key>PayloadIdentifier</key>
<string>com.apple.dnsSettings.managed.A74C8336-44BC-4C12-BF79-CBBC3B0FF5E0</string>
<key>PayloadUUID</key>
<string>A468C1F3-9309-4BE7-B6CA-B4CA75EC66A3</string>
<key>PayloadVersion</key>
<integer>1</integer>
<key>ProhibitDisablement</key>
<false/>
</dict>
</array>
<key>PayloadDisplayName</key>
<string>Cloudflare (No Malware) - DNS over HTTPS</string>
<key>PayloadDescription</key>
<string>This profile configures your device to use Cloudflare (No Malware) DNS over HTTPS.

It is compatible with devices running iOS 14 and macOS 11.0 or later.</string>
<key>PayloadType</key>
<string>Configuration</string>
<key>PayloadIdentifier</key>
<string>com.joseph-rees.encrypted-dns</string>
<key>PayloadUUID</key>
<string>21CDCCD3-3351-423E-A7C5-AE9F17DFB8A2</string>
<key>PayloadVersion</key>
<integer>1</integer>
<key>PayloadRemovalDisallowed</key>
<false/>
</dict>
</plist>